
FISH_DB = {
"amago": {
    "名前": "アマゴ",
    "外見": "体は細長く、背中は茶褐色。体側には小さな赤い斑点があり、銀白色の腹を持つ。体全体に特徴的な模様がある",
    "習性": "冷たくきれいな清流に生息し、水生昆虫や小魚などを食べる。警戒心が強く、岩陰などに隠れていることが多い。春から夏にかけて活発に活動する",
    "type": "在来種"
},
    "ayu": {
        "名前": "鮎",
        "外見": "体は細長く、銀白色。背中はやや黒く、体側に淡い黄色の斑点がある。特有の香りを持つ",
        "習性": "清流に生息し、縄張り意識が強い。石に付いた藻類を食べ、夏に活発に活動し、秋に産卵のため下流へ移動する。",
        "type": "在来種"
    },
    "carp": {
        "名前": "鯉",
        "外見": "体はやや丸く大きく、色は黒・茶・金色などさまざま。口元にひげがあるのが特徴",
        "習性": "川池、湖など幅広い水域に生息し、環境への適応力が高い。雑食性で、水草や小さな生物を食べる。比較的ゆっくり泳ぎ、群れで行動することが多い。",
        "type": "在来種"
    },
    "blackbass": {
        "名前": "ブラックバス",
        "外見": "体はやや細長く、口が大きい。体色は緑がかった黒色で、体側に黒い横帯が見られる",
        "習性": "湖やダム、流れの緩やかな川に生息する肉食魚。小魚やエビ、昆虫などを捕食する。攻撃性が強く、物陰に隠れて獲物を待ち伏せする習性がある。",
        "type": "外来種"
    },
    "bluegill": {
        "名前": "ブルーギル",
        "外見": "体は平たく丸みがあり、側面は青緑色。えらぶたの後ろに黒い斑点があるのが特徴",
        "習性": "湖や池、流れの緩やかな川に生息する雑食性の魚。昆虫や小魚、水草などを食べる。繁殖期には浅瀬に巣を作り、群れで行動することが多い。",
        "type": "外来種"
    },
    "funa": {
        "名前": "鮒",
        "外見": "体はやや丸く側扁し、色は銀色や茶色。口元にひげはない",
        "習性": "池や川、湖などに広く生息し、環境への適応力が高い。雑食性で、水草やプランクトン、小さな生物を食べる。群れで行動することが多い",
        "type": "在来種"
    },
    "kawamutsu": {
        "名前": "カワムツ",
        "外見": "体は細長く、銀色を基調とし、体側に黒い縦帯が見られる。ひれはやや黄色みを帯びることがある。",
        "習性": "川の中流域に多く生息し、流れのある場所を好む。雑食性で、昆虫や小型の水生生物、藻類などを食べる。群れで行動することが多い。",
        "type": "在来種"
    },
"namazu": {
    "名前": "ナマズ",
    "外見": "体が細長く、口の周りに長いひげがあります。",
    "習性": "夜行性で、川や池などの水底付近で活動します。",
    "type": "在来種",
    "⚠️ 注意":"ナマズは汚れた環境に生息している場合があるため、衛生面を考慮し、釣ったナマズは持ち帰って食べることをおすすめしません。"

},
    "nigoi": {
        "名前": "似鯉",
        "外見": "体は細長く円筒形で、色は灰褐色。口は下向きで、口元にひげがある",
        "習性": "川の中下流域に生息し、流れのある場所を好む。底に近い場所で生活し、主に底生生物や小魚などを食べる。遊泳力が強く、活発に動き回る",
        "type": "在来種"
    },
    "nijimasu": {
        "名前": "虹鱒",
        "外見": "体はやや細長く、銀色を基調とし、体側に虹色の帯が見られる。体やひれに黒い斑点がある",
        "習性": "冷たく清らかな水を好み、川や湖に生息する。肉食性で、昆虫や小魚などを食べる。遊泳力が高く、活発に動き回る。",
        "type": "在来種"
    },
    "oikawa": {
        "名前": "オイカワ",
        "外見": "体は細長く銀白色で、体側に青い帯が見られる。繁殖期のオスは体色が鮮やかになる。",
        "習性": "川の中流域に生息し、流れのある場所を好む。雑食性で、昆虫や藻類などを食べる。群れで行動することが多い。",
        "type": "在来種"
    },
    "oyanirami": {
        "名前": "オヤニラミ",
        "外見": "体はやや側扁し、黄褐色を基調に不規則な模様がある。大きな目が特徴",
        "習性": "川や湖の流れの緩やかな場所に生息する肉食性の魚。小魚やエビ、昆虫などを捕食する。縄張り意識が強く、単独で行動することが多い。",
        "type": "保護種"
    }
}

def get_fish_info(label):
    return FISH_DB.get(label, {
        "name": "",
        "feature": "",
        "habit": "",
        "type": ""
    })

